pages/news.htm
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-28 Fri 13:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Site News and Weblog</title>
<meta name="description" content="In the 1990's things were crazy and you never knew what browser would be best for a site...unless they told you ;)" />
<meta name="generator" content="Org Mode" />
<link href="../styles/main.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Site News and Weblog</h1>
<p>
In the mid to late 1990&rsquo;s, there was a new type of website that popped up. These sites were dedicated to people&rsquo;s opinions or news. We called them weblogs, but this wasn&rsquo;t eventually shortened to just blog. In the modern age, these have largely be replaced by macro-blogs like Twitter or social sites like Facebook, but, before then, the blog was the way to put your opinions out there. Here, I will be putting a my own thoughts about various topics, but this will remain mostly a place for site news.
</p>

<ul class="org-ul">
<li><a href="./blog/28-Jul-2023.htm">28 Jul 2023 - Plans for the Site</a></li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-07-28 Fri 13:36</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6)</p>
</div>
</body>
</html>
